-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:5000
-- Generation Time: Mar 04, 2025 at 01:44 AM
-- Server version: 5.7.24
-- PHP Version: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bookstore`
--

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `AdminID` int(255) NOT NULL,
  `AdName` varchar(255) NOT NULL,
  `AdEmail` varchar(255) NOT NULL,
  `AdPassword` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`AdminID`, `AdName`, `AdEmail`, `AdPassword`) VALUES
(1, 'นาราย อธิบาย', 'Narai.AH58@gmail.com', 'NR725@AH'),
(2, 'ทาเคดะ ชาติพุก', 'Takeda.MK12@gmail.com', 'Tata797@Game'),
(3, 'ชัชภณ จันทร์โอชา', 'DiCha0-0@gmail.com', 'ChunOO@00'),
(4, 'ฐสิษฐ์ จินดากุล', 'StephenU03@gmail.com', 'See0-3Joke'),
(5, 'บารมี เหินเวหา', 'Skywalk47_69@gmail.com', 'Skywalker_N00'),
(6, 'สรณบดินทร์ รุ่งเรือง', 'Glory89_86@gmail.com', 'Gloria_58170'),
(7, 'จิรายุ ประสารทรัพย์', 'Jirayu_Sun34@gmail.com', 'JirayaISCHAD12'),
(8, 'ญาณกร แจงใส', 'Mar_bie22@gmail.com', 'Marmarbie@1234'),
(9, 'ชนกนนัท์ เจริญใจ', 'KK_36l@gmail.com', 'King@K_3669'),
(10, 'ธนาวิน คงคา', 'Lakesd_55@gmail.com', 'Eva_Lake78');

-- --------------------------------------------------------

--
-- Table structure for table `book`
--

CREATE TABLE `book` (
  `BookID` int(255) NOT NULL,
  `BookName` varchar(255) NOT NULL,
  `Quantity` int(255) NOT NULL,
  `BookType` enum('Manga','Light Novel','นิยาย') NOT NULL,
  `SubType` enum('None','Romantic','Crime','Action','Fantasy','Yaoi','Yuri') NOT NULL,
  `CheckIN` date NOT NULL,
  `Description` varchar(21000) NOT NULL,
  `BookPrice` float NOT NULL,
  `BookImage` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `book`
--

INSERT INTO `book` (`BookID`, `BookName`, `Quantity`, `BookType`, `SubType`, `CheckIN`, `Description`, `BookPrice`, `BookImage`) VALUES
(1, 'เชอร์ล็อก โฮล์มส์ 1 ตอน แรงพยาบาท', 20, 'นิยาย', 'Crime', '2024-02-01', '\r\nหนังสือชุดเชอร์ล็อก โฮล์มส์ ตอน A Study in Scarlet  หรือในภาคภาษาไทยว่า แรงพยาบาท นี้ ได้รับการตีพิมพ์เผยแพร่ครั้งแรกในปี ค.ศ.1887  ซึ่งเรื่องนี้ เซอร์อาร์เทอร์ โคแนน ดอยล์เขียนขึ้นก่อนที่จะพัฒนาตัวเองขึ้นเป็นนักเขียนนิยายสืบสวนสอบสวนอย่างเต็มตัว  เนื่องจากเป็นเรื่องแรก จึงเป็นจุดที่เหมาะสมและน่าสนใจอย่างยิ่งที่จะเริ่มต้นอ่านหนังสือชุดนี้ เพราะจะทำให้ผู้อ่านได้รู้จักตัวละครสำคัญ ที่ชื่อ เชอร์ล็อก โฮล์มส์ ซึ่งต่อมาจนถึงปัจจุบัน ได้กลายเป็นตัวละครอมตะที่มีชื่อเสียงอย่างยิ่งและกลายเป็นสัญลักษณ์ของนักสืบในวรรณกรรมแนวสืบสวนสอบสวนทีเดียว\r\nเนื้อหาเริ่มต้นเป็นการพบและรู้จักกันเป็นครั้งแรกของโฮล์มส์ และ หมอวัตสัน ตัวเอกของเรื่อง หมอวัตสันได้พบว่าโฮล์มส์เป็นนักสืบที่ปรึกษา ทำงานร่วมกับตำรวจนักสืบเพื่อช่วยงานราชการ และขณะเดียวกันก็รับจ้างบุคคลอื่นๆ สืบสวนเรื่องต่างๆ ด้วย  ด้วยความรอบรู้ในหลายๆ ด้าน ความสามารถ ความคิดและการทำงานของเชอร์ล็อค โฮล์มส์ที่แปลกแตกต่างไปจากคนอิ่นๆ ทำให้หมอวัตสันต้องฉงนสนเท่ห์ใจ ทั้งประทับใจจนทั้งสองได้กลายเป็นเพื่อนรักกันในไม่ช้า\r\nสำหรับคดีในเรื่องนี้เกี่ยวข้องกับศพของชายคนหนึ่งซึ่งถูกพบในบ้านร้าง โดยมีคำว่า RACHE เขียนด้วยเลือดบนกำแพงข้างศพ เชอร์ล็อก โฮล์มส์ ต้องใช้ไหวพริบปฏิภาณสืบสวนจนพบตัวฆาตกร ส่วนครึ่งหลังของเล่มเป็นเรื่องราวความรักความแค้นอันเป็นที่มาของฆาตกรรมรายนี้\r\nเรื่องนี้มีเนื้อหาเกี่ยวข้องกับประวัติของพวกมอร์มอน หรือ สิทธิชนยุคสุดท้าย อยู่อย่างสำคัญ  ซึ่งขอให้ผู้อ่าน โปรดใช้วิจารณญาณในการอ่านตามสมควร เนื่องจากเป็นเรื่องแต่ง ที่อาจมีอคติของผู้เขียนปะปนอยู่มาก อันอาจทำให้บางช่วงตอนผิดเพี้ยนไปจากข้อเท็จจริงได้', 115, 'Sherlock_Holmes1.png'),
(2, 'สืบคดีปริศนา หมอยาตำรับโคมแดง เล่ม 1', 10, 'Light Novel', 'Crime', '2024-02-01', 'ณ อาณาจักรใหญ่ยักษ์แห่งหนึ่งซึ่งตั้งอยู่ใจกลางทวีป เด็กสาวนางหนึ่งผู้ทำงานเป็นหมอยาในสถานเริงรมย์ย่านโคมแดงอันมีนามว่า ‘เมาเมา’ บัดนี้เกิดจับพลัดจับผลูต้องมาทำงานรับใช้อยู่ในวังหลัง\r\n\r\nเธอทำได้เพียงเฝ้ารอให้หมดวาระการทำงานอย่างสงบเสงี่ยมเจียมตัว ด้วยรูปร่างหน้าตาที่ไม่สะสวยจึงมั่นใจเป็นนักหนาว่าตนจะไม่มีวันโดนจักรพรรดิเรียกไปเป็น ‘คู่นอน’ อย่างแน่แท้\r\n\r\nแต่ในขณะนั้นเอง โอรสธิดาของจักรพรรดิกลับมีเหตุให้อายุสั้น\r\nพอรู้ว่าสองทารกน้อยที่ยังเหลือรอดกำลังป่วยหนัก เมาเมาจึงลงมือขุดคุ้ยหาสาเหตุ—', 295, 'Kusuriya_no_Hitorigoto_LN_vol1.png'),
(3, 'คุณอาเรียโต๊ะข้างๆพูดรัสเซียหวานใส่ ซะหัวใจจะวาย เล่ม 1', 10, 'Light Novel', 'Romantic', '2024-02-01', '“หา? พูดว่าไง?” “เปล่านี่? ก็แค่บอกว่า \'หมอนี่โง่จริงๆเลย\' แค่นั้นเอง” “เลิกด่าเป็นภาษารัสเซียได้ไหม!?” คุณอาเรียยิ้มกริ่ม เธอคือสาวเจ้าของเรือนผมสีเงินผู้สวยไม่เป็นสองรองใครที่นั่งข้างผม... แต่ความจริงมันไม่ใช่อย่างนั้นเสียหน่อย ภาษารัสเซียที่เธอพูดเมื่อกี๊นี้มันคือ \'สนใจฉันหน่อย\' ต่างหากล่ะ!   อันที่จริงตัวผม คุเซะ มาซาจิกะ มีทักษะการฟังภาษารัสเซียระดับเทียบเท่าเจ้าของภาษา เพียงแต่ไม่เปิดเผยเรื่องนั้นให้ใครรู้ วันนี้ก็เป็นอีกวันที่อดยิ้มไม่อยู่ เพราะคุณอาเรียมาหยอดคำหวานใส่เป็นภาษารัสเซียอีกแล้ว!?   เรื่องราวเลิฟคอมเมดี้วัยใส กับนักเรียนสาวมัธยมปลายชาวรัสเซียผู้สวยเลิศเลอ จนเป็นที่หมายปองของใครต่อใคร!', 275, 'Tokidoki_Bosotto_Russiago_LN_vol1.png'),
(4, 'ลอร์ดออฟเดอะริง เล่ม 1 มหันตภัยแห่งแหวน', 10, 'นิยาย', 'Fantasy', '2024-02-01', 'ลอร์ดออฟเดอะริงส์ เล่ม 1 ตอนมหันตภัยแห่งแหวน\r\n\r\nลอร์ด ออฟ เดอะ ริงส์ เล่ม1 ปฐมบทของภารกิจทำลายแหวน\r\nซึ่งนำไปสู่สงครามครั้งยิ่งใหญ่ของโลกที่ไม่ได้มีแค่มนุษย์อาศัยอยู่\r\nและยังมีพวกเอลฟ์ ฮอบบิท คนแคระ โทรลล์ ออร์ค และเผ่าพันธุ์อื่นๆ\r\nเรื่องราวเริ่มต้นที่งานเลี้ยงอำลาที่ไม่มีใครคาดฝัน “บิลโบ แบ๊กกิ้นส์”\r\nออกจากบ้านไป ละทิ้งสมบัติพัสถานทุกอย่าง รวมทั้งแหวนอันเป็น\r\nมหันตภัยวงหนึ่งให้ตกเป็นของหลานรัก “โฟรโด แบ๊กกิ้นส์” โดยไม่\r\nรู้ว่านั่นคือการมอบมรดกอันเป็นหายนะโดยแท้ โฟรโดต้องออกเดินทาง\r\nสู่โลกกว้าง ฝ่าฟันอันตรายนานัปการเพื่อนำแหวนไปทำลายในดินแดน\r\nของอสูรร้ายที่สร้างมันขึ้นมา', 635, 'LOTR1.png'),
(5, 'มุมมองนักอ่านพระเจ้า เล่ม 1', 1, 'นิยาย', 'Fantasy', '2024-02-01', '[ สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ]\r\nคือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’\r\nเขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน\r\nและรู้ว่าเรื่องนี้จะจบลงอย่างไร\r\n.\r\nดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย\r\nท่ามกลางความหายนะต่างๆ นานา\r\nและ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์\r\nคิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน\r\nแต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน\r\n.\r\nโลกเปลี่ยนแปลงไปแล้ว\r\nและนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย\r\nก็ค่อยๆ เปลี่ยนแปลงไป เพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน\r\n.\r\nปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้ว\r\nคุณล่ะ … พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง', 295, 'ORV1.png'),
(6, 'คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย เล่ม 2 ', 20, 'Light Novel', 'Romantic', '2024-02-01', '“ชะ...ชอบ? ชอบเหรอ เอ๊ะ? ไม่ใช่สักหน่อย ไม่ใช่น้าาาา～!”\r\n\r\n“ทำมาเป็น～ ‘ฉันจะเป็นกำลังให้เอง’ โอ๊ย～เรานี่มันน่าขนลุก สะเหล่อ!”\r\n\r\nจากเหตุการณ์ลับที่รู้กันสองคนซึ่งเกิดขึ้นในสวนโรงเรียนยามอาทิตย์อัสดง\r\n\r\nทั้งอาเรียและมาซาจิกะต่างกลุ้มใจกันทั้งคู่\r\n\r\nแต่ทั้งสองก็ได้สัญญาแล้วว่าจะจับคู่กันเพื่อลงชิงชัยในสนามเลือกตั้งประธานนักเรียน\r\n\r\n \r\n\r\nอาเรียและมาซาจิกะจึงเริ่มประชุมวางแผนเพื่อเผชิญหน้ากับสุโอ ยูกิ\r\n\r\nตัวเก็งผู้ลงสมัครเลือกตั้งประธานนักเรียนสมัยหน้า ซึ่งมีเสน่ห์ดึงดูดใจมหาศาล แต่ทว่า—\r\n\r\n“เอาละ...งั้นก็ เรื่องเลือกตั้งประธานน่ะนะ”\r\n\r\n“…Круто♡”\r\n\r\n‘อ๊อก!’ เสียงกระซิบหวานๆภาษารัสเซียทำเอาใจเต้นซะได้!?\r\n\r\nนึกว่าจะประณามหยาดเหยียดกัน แต่ดันหวานใส่เฉย\r\n\r\nเรื่องราวเลิฟคอเมดี้วัยใส\r\n\r\nกับนักเรียนสาวมัธยมปลายชาวรัสเซียผู้สวยเลิศเลอ\r\n\r\nที่ทำให้ต้องยิ้มแก้มปริ เล่ม 2!', 295, 'Tokidoki_Bosotto_Russiago_LN_vol2.png'),
(7, 'มุมมองนักอ่านพระเจ้า เล่ม 2', 0, 'นิยาย', 'Fantasy', '2024-02-01', '[ สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ] คือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’\r\nเขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน\r\nและรู้ว่าเรื่องนี้จะจบลงอย่างไร\r\nดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย\r\nท่ามกลางความหายนะต่างๆ นานา\r\nและ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์\r\nคิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน\r\nแต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน\r\n\r\nโลกเปลี่ยนแปลงไปแล้ว\r\nและนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย\r\nก็ค่อยๆ เปลี่ยนแปลงไป เพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน\r\n\r\nปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้ว\r\nคุณล่ะ … พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง', 295, 'ORV2.png'),
(8, 'เบเรนและลูธิเอน', 25, 'นิยาย', 'Fantasy', '2024-02-10', ' ย้อนกลับไปยุคแรกของโลกมิดเดิลเอิร์ธเบเรน (มนุษย์) ชายหนุ่มคนเดียวที่รอดชีวิตจากการต่อสู้กับมอร์ก็อธ (เจ้าแห่งอสูร เหนือกว่าเซารอน) พบรักกับลูธิเอน (เอลฟ์) ลูกสาวกษัตริย์ธิงโกล ผู้ครองโดริอัธ แต่สมัยนั้นยังไม่เคยมีเอลฟ์กับมนุษย์แต่งงานกันมาก่อน ธิงโกล ในฐานะพ่อ ไม่ยอมให้ลูธิเอนแต่งงานข้ามเผ่าพันธุ์ เขาจึงมอบหมายภารกิจที่ยากที่สุดให้เบเรนคือ หากเบเรนไปนำซิลมาริลที่มอร์กอธขโมยไปจากเอลฟ์กลับมาได้ ถึงจะได้แต่งงานกับลูธิเอนเบเรนออกเดินทางตามหามอร์ก็อธ โดยมีลูธิเอนหนีพ่อตามมาด้วย ทั้งสองผ่านอันตรายต่าง ๆ ด้วยกันมากมาย จนเบเรนชิงซิลมาริลมาได้ ทว่าขณะหนีกลับเมือง ก็โดนหมาป่าของมอร์ก็อธกัดมือข้างที่ถือซิลมาริลไว้จนขาด เบเรนกับลูธิเอนจึงกลับถึงโดริอัธแบบภารกิจล้มเหลว อย่างไรก็ตาม เมื่อธิงโกลทราบเรื่องราวทั้งหมด ก็ใจอ่อนยอมยกลูกสาวให้มนุษย์ และออกตามล่าหมาป่าตัวนั้นเพื่อนำซิลมาริลคืนมา โดยมีเบเรนออกเดินทางไปด้วย ซึ่งเขาเสียชีวิตจากภารกิจนี้\r\n   ลูธิเอนเศร้าโศกเสียใจอย่างหนักจนตรอมใจตาย ซึ่งตามธรรมเนียมเอลฟ์ หลังจบชีวิตแล้วจะต้องไปยังดินแดนหนึ่งเพื่อรอการคืนชีพ และที่นี่เองลูธิเอนได้พบเจ้าแห่งความตาย ผู้เห็นว่าเธอเสียใจอย่างหนัก จึงยื่นข้อเสนอให้สองข้อ หนึ่งคืนชีพไปมีชีวิตอมตะตามธรรมเนียม แต่ความทรงจำส่วนที่มีเบเรนถูกลบเลือน หรือคืนชีพพร้อมเบเรน แต่สูญเสียชีวิตอมตะของเอลฟ์ ซึ่งลูธิเอนเลือกข้อสอง  ', 425, 'Beren_and_Luthien.png'),
(9, 'ตำนานแห่งซิลมาริล', 25, 'นิยาย', 'Fantasy', '2025-02-10', 'ปฐมบทของมหากาพย์ลอร์ด ออฟ เดอะ ริงส์ ว่าด้วยเหตุการณ์ในอดีตนับแต่สมัยที่มอร์ก็อธ เทพอสูรองค์แรก ยังอยู่บนมิดเดิ้ลเอิร์ธ และพวกไฮเอลฟ์ทำสงครามขับเคี่ยวกับเขาเพื่อช่วงชิงซิลมาริลของพวกตนกลับคืน\r\n\r\n  นี่คือประวัติศาสตร์ของโลกก่อนยุคมิดเดิ้ลเอิร์ธที่โทลคีนบรรจงสร้างขึ้นอย่างละเอียด โดยมีพื้นฐานจากวัฒนธรรมของพวกเอลดาร์ ผู้ใช้ภาษาเควนยาและภาษาซินดาริน อันเป็นภาษาประดิษฐ์ที่โทลคีนสร้างขึ้นอย่างสมบูรณ์ ใช้งานได้จริง พื้นฐานของเรื่องทั้งหมดจึงเป็นเรื่องของพวกเอลดาร์ หรือเอลฟ์ ผู้ใช้ภาษาของโทลคีนนั่นเอง\r\n\r\nหนังสือเล่มนี้ไม่ได้บรรจุเพียงเรื่องเกี่ยวกับตำนานแห่งซิลมาริลเพียงเท่านั้น หากยังประกอบด้วยเรื่องราวสั้นๆ อีก 4 เรื่อง ได้แก่ ไอนูลินดาเล และ วาลาเควนตา ซึ่งบรรยายถึงเหตุการณ์เริ่มแรกของทุกสิ่ง และเป็นส่วนที่มีความเกี่ยวข้องอย่างใกล้ชิดกับตำนานแห่งซิลมาริล  ไปจนถึงเรื่องอคัลลาเบธ และว่าด้วยแหวนแห่งอำนาจ ที่ปรากฏอยู่ตอนท้ายเล่ม ซึ่งเป็นเรื่องราวที่จะช่วยเติมเต็มประวัติศาสตร์ทั้งมวลนับแต่กาลเริ่มต้นของโลก จนกระทั่งถึงการเดินทางออกจากท่าเรือมิธลอนด์ของบรรดาผู้ถือแหวนในกาลสิ้นสุดของยุคที่สาม อันเป็นยุคที่ลอร์ดออฟเดอะริงส์เริ่มต้นขึ้น\r\n\r\n', 595, 'Silmarillion.png'),
(10, 'Made in Abyss ผ่าเหวนรก เล่ม 1', 9, 'Manga', 'Fantasy', '2024-02-10', 'ในโลกที่ทุกสิ่งทุกอย่างถูกสำรวจขุดค้นจนกระจ่างแจ้ง\r\nมีเพียงหลุมยักษ์นาม ‘อะบิส’ แห่งนี้ซึ่งยังคงเป็นพื้นที่ปริศนา\r\nภายใต้หลุมลึกขนาดมหึมาที่ไม่มีใครรู้ว่าสุดปลายของมันทอดยาวยังแห่งหนใด\r\nมีสิ่งมีชีวิตแปลกประหลาดพิสดาร และวัตถุโบราณล้ำค่า\r\nที่มนุษย์ยุคปัจจุบันไม่อาจสรรค์สร้างกำลังหลับใหล\r\nความลึกลับของอะบิสดึงดูดให้ผู้คนที่หลงเสน่ห์แสนน่าพิศวงออกผจญภัย\r\nและพยายามไขปริศนา กลุ่มบุคคลที่มาผจญภัยยังหลุมยักษ์แห่งนี้ครั้งแล้วครั้งเล่า\r\nจึงได้รับการขนานนามว่า ‘นักสำรวจ\r\n\r\n \r\n\r\nริโค่ เด็กหญิงกำพร้าพ่อแม่ที่อาศัยอยู่ใน ‘ออร์ธ’ เมืองซึ่งสร้างขึ้นรอบปากหลุมอะบิส\r\nใฝ่ฝันจะเป็นนักสำรวจผู้ยิ่งใหญ่เช่นเดียวกับแม่ของเธอ และอยากจะไขปริศนาของอะบิสให้กระจ่าง\r\nวันหนึ่งขณะที่กำลังสำรวจปากหลุมอะบิส เธอบังเอิญเก็บหุ่นยนต์เด็กผู้ชายได้ตัวหนึ่ง...?\r\nนั่นคือจุดเริ่มต้นการผจญภัยแบบไปไม่กลับของทั้งคู่\r\n\r\n\r\nพบกับที่สุดของการ์ตูนแอ็กชั่นผจญภัยครั้งยิ่งใหญ่แห่งศตววรษที่ 21\r\nผสมปนเปด้วยเครื่องจักรและจินตนาการสุดหยั่งถึงอย่างที่การ์ตูนแนวผจญภัยควรมี!!', 155, 'Made_in_Abyss_vol1.png'),
(11, 'ELDEN RING เส้นทางสู่พฤกษาทอง 1', 5, 'Manga', 'Fantasy', '2024-02-10', '  อาเซโอะ ผู้มัวหมองยากไร้ไม่มีแม้กระทั่งเสื้อผ้าใส่ถูกขับไล่ไปยังลิมเกรฟแห่งดินแดนมัชฌิมา ในขณะที่จิตใจของเขาใกล้แตกสลายเพราะความโหดร้ายของดินแดนแห่งนี้ เมลิน่า เด็กสาวปริศนาก็หยิบยื่นข้อเสนอให้เขามุ่งหน้าไปยังพฤกษาทอง ทว่าระหว่างทางที่มุ่งไปมีผู้คนมากมายหลายรูปแบบรอเผชิญหน้ากับเขาอยู่ ไม่ว่าจะเป็นแพทช์ ผู้ไร้พันธะ, ไบลด์ ลูกครึ่งหมาป่า, มาร์กิต อสุราต้องสาป, ก็อดดริกร้อยกิ่ง และแม่มดแรนนี่...อาเซโอะจะเอาตัวรอดไปจนถึงปราสาทสตอร์มวีลอันเป็นที่หมายแห่งแรกได้หรือไม่—!?', 175, 'Elden_Ring_vol1.png'),
(12, 'ELDEN RING เส้นทางสู่พฤกษาทอง 2', 5, 'Manga', 'Fantasy', '2024-02-17', '  อาเซโอะ ผู้มัวหมองที่ออกสำรวจปราสาทสตอร์มวีลได้เรียนรู้การเตรียมใจของนักรบจากนักรบหญิงเนเฟลี รูส์และสุดท้ายก็เข้าปะทะตรงๆกับครึ่งเทพ ก็อดดริกร้อยกิ่ง!การต่ออันดุเดือดที่มีแม้กระทั่งอดีตศัตรูสุดแกร่งและเมลิน่ามาพัวพันด้วยจะจบลงอย่างไร!?หลังจากนั้นเมลิน่าก็ช่วยชี้นำให้อาเซโอะได้ไปเยือน‘โต๊ะกลม’ แหล่งชุมนุมของบรรดาวีรชนการพบพานกับเซอร์กิเดียน ออฟเนียร์ ผู้รอบรู้\r\nเอเนีย หญิงร่างทรงองคุลี และเฟีย นารีแห่งผู้วายชนม์จะช่วยให้อาเซโอะเติบโตในฐานะ ‘วีรชนผู้มีพรชี้นำ’ ได้หรือไม่—!?', 175, 'Elden_Ring_vol2.png'),
(13, 'ELDEN RING เส้นทางสู่พฤกษาทอง 3', 10, 'Manga', 'Fantasy', '2024-02-17', ' เมื่อได้พบกับแม่มดแรนนี่อีกครั้งที่แคลิด ผู้มัวหมองอาเซโอะก็ทำตามคำแนะนำของเธอและเปลี่ยนจุดหมายไปยังทะเลสาบลิเออร์เนีย โดยตั้งเป้าจะไปเอามหารูนในวิทยาลัยคาถาเรยา ลูคาเรีย หลังจากเรียนคาถาจากจอมเวทโธปส์แห่งวิทยาลัย อาเซโอะเป็นต้องวุ่นเพราะคำขอของรายา หญิงสาวปริศนา และระหว่างนั้นก็ได้พบกับแพทช์ ผู้ไร้พันธะอีกครั้ง ทั้งสองร่วมมือกันเผชิญหน้ากับมังกรหินจรัสสมาแร็ค\r\nเพื่อเข้าไปในวิทยาลัย และท่ามกลางการต่อสู้เสี่ยงตายนั้น ความสามารถที่ซ่อนเร้นอยู่ของอาเซโอะก็ตื่นขึ้นมาในที่สุด!? สิ่งที่รอคอยอาเซโอะอยู่ที่วิทยาลัยคาถาเรยา ลูคาเรียคืออะไรกันแน่—!?', 175, 'Elden_Ring_vol3.png'),
(14, 'ELDEN RING เส้นทางสู่พฤกษาทอง 4', 10, 'Manga', 'Fantasy', '2024-02-17', ' ผู้มัวหมองอาเซโอะยังคงสำรวจวิทยาลัยคาถาเรยา ลูคาเรียต่อไปเพื่อแสวงหามหารูน หลังจากที่แม่มดแรนนี่เผยว่าเร็นนาล่าผู้ปกครองวิทยาลัยคือมารดาของตน และขอให้อาเซโอะชิงมหารูนมาโดยไม่ฆ่าเธอเขาก็ก้าวเข้าสู่หอสมุดกลางอันเป็นที่อยู่ของเร็นนาล่า และได้เห็นสภาพไม่นึกไม่ฝันของ ‘ราชินีจันทร์เพ็ญ’อาเซโอะจึงต้องเผชิญหน้ากับเธอเพื่อชิงมหารูน แต่เรื่องกลับลงเอยอย่างเหนือความคาดหมาย...!!และแล้วหลังจากพบกับคนหน้าใหม่และเหล่าคนที่รู้จักกันดีอีกครั้ง เป้าหมายในการเดินทางถัดไปของอาเซโอะก็คือตามหาสมบัติ—!?', 175, 'Elden_Ring_vol4.png'),
(15, 'ELDEN RING เส้นทางสู่พฤกษาทอง 5', 9, 'Manga', 'Fantasy', '2024-02-17', 'ผู้มัวหมองอาเซโอะยังคงเดินทางต่อไปเพื่อแสวงหามหารูนอันที่ 2\r\nหลังได้พบเห็นโศกนาฏกรรมที่แหลมเสียงสะอื้น เขาก็ได้รับคำแนะนำ\r\nจากเมลิน่าและมุ่งหน้าไปร่วม ‘เทศกาลสงคราม’ ที่ปราสาทราชสีห์แดง\r\nระหว่างทางอาเซโอะได้พบโรเจียร์กับ D อีกครั้ง\r\nแถวหมู่บ้านที่มรณะแพร่ระบาด จึงร่วมมือกับ\r\nพวกเขาในการต่อสู้ แล้วย่างเข้าสู่แคลิดอีกครา\r\nหลังจากนั้นก็ได้พบกับนักปราชญ์โกว์รี่ที่นั่น\r\nและถูกไหว้วานให้ช่วยหญิงสาวชื่อมิลลิเซนต์\r\nที่ถูกโรคเสื่อมสลายรุกราน...!!\r\nเมื่อฟันฝ่าแคลิดไปได้ จะมีสิ่งใดรออยู่\r\nณ ปลายทางดินแดนที่ทิวทัศน์และศัตรู\r\nล้วนเหมือนอยู่ในขุมนรกกันแน่—!?', 175, 'Elden_Ring_vol5.png'),
(16, 'เชอร์ล็อก โฮล์มส์ 2 ตอน จัตวาลักษณ์', 10, 'นิยาย', 'Crime', '2024-02-18', ' จัตวาลักษณ์ จากเรื่องเดิม The Sign of Four เป็นเรื่องยาวเรื่องที่สองของหนังสือชุดเชอร์ล็อก โฮล์มส์ ประพันธ์โดย เซอร์อาเทอร์ โคแนน ดอยล์  พิมพ์เผยแพร่ครั้งแรกเมื่อปี ค.ศ. 1890 \r\nหลังจากที่เรื่องแรกในชุด คือ แรงพยาบาท (A Study in Scarlet)  ผู้แต่งเขียนเรื่องที่เกี่ยวข้องกับพวกมอร์มอนด้วยข้อมูลที่กล่าวได้ว่ามีอคติปะปนอยู่  ในเรื่องนี้ก็อีกเช่นกัน แต่คราวนี้เป็นคดีที่มีสาเหตุมาจากการทรยศหักหลัง สมบัติที่ถูกขโมย คำมั่นสัญญาลับของอดีตนักโทษสี่คน และประวัติศาสตร์การเมืองของอินเดีย ซึ่งผู้เขียนเขียนจากมุมมองของชาวอังกฤษในยุคนั้นที่อาจผิดเพี้ยนไปจากข้อเท็จจริงอยู่บ้าง   อย่างไรก็ตาม เมื่อกล่าวเฉพาะเนื้อหาโดยรวมและการเดินเรื่อง ที่โฮล์มส์ได้ทำการสืบสวน และวางอุบายเพื่อจับตัวคนร้าย  เป็นปริศนาซ้อนปริศนาที่มีโฮล์มส์เท่านั้นที่สามารถคลี่คลายได้ ก็สนุกจนอ่านเพลินกันแล้ว\r\n    นอกจากจะได้เพลิดเพลินกับเนื้อหาและงานการสืบสวน ผู้อ่านจะต้องแปลกใจที่ได้รู้พฤติกรรมอย่างหนึ่งของโฮล์มส์ อันไม่น่าชื่นชมและไม่ควรเลียนแบบเป็นอย่างยิ่ง ทั้งยังจะได้รู้จักสาวสวยนางหนึ่ง ที่ได้กลายมาเป็นคู่รักของหมอวัตสันและจะได้เป็นภรรยาในที่สุด', 105, 'Sherlock_Holmes2.png'),
(17, 'เชอร์ล็อก โฮล์มส์ 3 ตอน หมาผลาญตระกูล', 10, 'นิยาย', 'Crime', '2024-02-18', '  เรื่อง หมาผลาญตระกูล The Hound of the Baskervilles  ได้เคยลงพิมพ์เป็นตอน ๆ ในนิตยสารสแตรนด์ ช่วงปี ค.ศ. 1901–1902   สำหรับภาษาไทยใช้ชื่อว่า  หมาผลาญตระกูลสองเรื่องที่ผ่านมา เป็นเหตุการณ์ที่เกิดขึ้นในเมือง  แต่เรื่องนี้ตัวละครได้ออกไปผจญภัยนอกเมืองในสถานที่ที่เป็นทุ่งหญ้า  เมื่อเซอร์ชาร์ลส์ บาสเกอร์วิลล์ ถูกพบเสียชีวิตในสวนบริเวณคฤหาสน์ของเขา ในสภาพที่ดูเหมือนหัวใจวาย แต่เพื่อนสนิทเชื่อว่าเป็นฝีมือของสัตว์ที่มีอำนาจเหนือธรรมชาติซึ่งตามล้างตามผลาญคนในตระกูลนี้ ร้อนถึงเชอร์ล็อก โฮล์มส์ ที่ถูกตามตัวมาไขปริศนาลึกลับนี้ในเรื่องนี้ดร.วัตสัน ได้แสดงบทบาทสำคัญช่วยโฮล์มส์ในการสืบสวน แต่เนื่องจากเขาไม่ใช่นักสืบผู้ยิ่งใหญ่อย่างโฮล์มส์ เพราะฉะนั้น สุดท้ายก็ต้องเป็นโฮล์มส์เท่านั้นที่คลี่คลายปริศนาทั้งหมดได้แม้เรื่องนี้จะได้รับการเขียนขึ้นหลังจากที่ผู้เขียนได้ทำให้เหมือนโฮล์มส์เสียชีวิตไปแล้วจากเรื่องสั้นเรื่องหนึ่งในชุด   แต่เมื่อทนเสียงเรียกร้องจากบรรดาผู้คลั่งไคล้เชอร์ล็อก โฮล์มส์ไม่ได้ โฮล์มส์จึงได้หวนกลับมาในเรื่องยาว หมาผลาญตระกูล เรื่องนี้    และนับได้ว่า เป็นเรื่องเอกในชุดเรื่องหนึ่งเลยทีเดียว  ปริศนาของเรื่องชวนให้ติดตาม จุดจบของเรื่องก็น่าตื่นเต้น  คุณจะไม่เสียใจที่ได้อ่าน', 135, 'Sherlock_Holmes3.png'),
(18, 'เชอร์ล็อก โฮล์มส์ 4 ตอน หุบเขาแห่งภัย', 10, 'นิยาย', 'Crime', '2024-02-18', 'หุบเขาแห่งภัย จากเรื่องเดิม The Valley of Fear ซึ่งเคยลงตีพิมพ์เป็นตอนๆ ระหว่างช่วงปี ค.ศ. 1914–1915  เป็นเรื่องที่มีความแตกต่างจากเรื่องยาวสามเรื่องแรกที่นำเสนอไปแล้วบ้างเล็กน้อย เนื่องจากเรื่องนี้ไม่เป็นเชิงลึกลับซับซ้อนน่าสงสัยเท่าไรนัก  การนำเสนอถูกแบ่งออกเป็นสองภาค เช่นเดียวกับเรื่อง แรงพยาบาท (A Study in Scarlet)  โดยภาคแรก เป็นภาคที่โฮล์มส์ ได้แสดงความสามารถร่วมกับ ดร.วัตสัน ตามปกติในการสืบสวนและแก้ไขปัญหาอาชญากรรม  ส่วนภาคสอง เป็นการเล่าเรื่องย้อนหลังโดยบุคคลที่เกี่ยวข้องกับสาเหตุของคดีอาชญากรรมในภาคแรก ไม่เกี่ยวอะไรกับตัวละครเอกทั้งสอง และนี่เป็นอีกครั้งหนึ่งที่ความพยาบาทอาฆาตแค้นเป็นต้นเหตุของอาชญากรรม\r\n   หุบเขาแห่งภัยแสดงความโหดร้ายขององค์กรฆาตกรรม  ความหวาดกลัวของประชาชนคนธรรมดา หรือชาวบ้านผู้ยากไร้ที่ต้องอดทนใช้ชีวิตด้วยความหวาดกลัว  ความอยุติธรรมที่ชาวบ้านทั่วไปต้องกล้ำกลืนฝืนรับ  และท้ายสุด อิสรภาพของพวกเขาที่ปลอดจากพวกที่คอยกดขี่ข่มเหงเหล่านั้น\r\n\r\n    เซอร์อาเทอร์ โคแนน ดอยล์ ทำให้เราแลเห็นด้านมืดของมนุษย์ได้ชัดเจน  นับเป็นเรื่องที่น่าติดตามอีกเรื่องหนึ่งของผู้ที่ชื่นชอบหนังสือชุดเชอร์ล็อก โฮล์มส์  เพราะความสามารถพิเศษของโฮล์มส์นั้นน่าทึ่งเสมอ', 135, 'Sherlock_Holmes4.png'),
(19, 'เชอร์ล็อก โฮล์มส์ 5 ตอน เรื่องสั้นชุดการผจญภัย', 3, 'นิยาย', 'Crime', '2024-02-18', 'เรื่องสั้นชุดการผจญภัย จากชื่อเรื่องเดิม The Adventures of Sherlock Holmes  เป็นเรื่องสั้นเชอร์ล็อก โฮล์มส์ ชุดแรก ประกอบด้วยทั้งหมด 12 เรื่อง เรื่องที่มีชื่อเสียงเป็นที่รู้จักกันดี อาทิ เหตุอื้อฉาวในโบฮีเมีย สันนิบาตผมแดง ห่วงแต้ม\r\nชุดรวมเรื่องสั้นนี้ เดิมเคยตีพิมพ์ในนิตยสารสแตรนด์มาก่อนในช่วงปี ค.ศ. ๑๘๙๑ – ๑๘๙๓   เป็นเรื่องสั้นจำนวน ๒๔ เรื่อง    แต่เมื่อได้รับการนำมาพิมพ์รวมเล่ม  ได้แยกสิบสองเรื่องแรกรวมไว้ใน ชุด การผจญภัย  ส่วนสิบสองเรื่องหลัง รวมอยู่ในชุด จดหมายเหตุ ซึ่งเป็นเล่มที่สำนักพิมพ์ได้จัดพิมพ์ไว้เป็นชุดเชอร์ล็อกส์ โฮล์มส์ ลำดับที่ ๖  \r\n    เหตุการณ์ต่างๆ ในเรื่องสั้นแต่ละเรื่อง โฮล์มส์ได้รับการติดต่อให้ใช้ความสามารถอันเป็นเอกของเขาให้เข้าไปสืบหาสาเหตุและช่วยแก้ไขปัญหาในคดีอาชญากรรมอันแตกต่างกันไป  หลายคดีบางครั้งเป็นเรื่องที่มีอันตราย  บางทีก็โหดร้ายทารุณ  แต่บ่อยครั้งทีเดียวที่รู้สึกว่าไม่มีอะไรที่ทำให้สับสนงุนงงเลย', 225, 'Sherlock_Holmes5.png'),
(20, 'เชอร์ล็อก โฮล์มส์ 6 ตอน เรื่องสั้นชุดจดหมายเหตุ', 10, 'นิยาย', 'Crime', '2024-02-18', ' แปลมาจาก The Memoirs of Sherlock Holmes เป็นเรื่องราวที่มีประเด็นของคดีแปลกพิสดารน่าติดตามในแบบของเชอร์ล็อก โฮล์มส์  และเป็นครั้งแรกที่มีการเปิดตัวพี่ชายของเขาให้เป็นที่รู้จัก ซึ่งเชอร์ล็อกกล่าวว่าพี่ชายของเขานี้มีความสามารถยิ่งกว่าตัวเขาเองเสียอีก  นอกจากนั้น ในคดีสุดท้ายยังเป็นการเปิดเผยความลับของเชอร์ล็อกที่มีกับศัตรูตัวฉกาจของเขา คือ ศาสตราจารย์มอริอาร์ตี ซึ่งจะทำให้เราทราบต้นสายปลายเหตุทั้งหลายที่เกี่ยวกับศาสตราจารย์ผู้นี้ รวมทั้งการหายตัวไปของเชอร์ล็อก โฮล์มส์ด้วย\r\n   เรื่องสั้นชุดนี้ประกอบด้วยคดีของเชอร์ล็อก โฮล์มส์ อีก 11 คดี อาทิ ม้าตัวเก็งหาย อุบายสับตัว ปริศนาลายแทง ชายหลังค่อม และจองเวร', 175, 'Sherlock_Holmes6.png'),
(21, 'เชอร์ล็อก โฮล์มส์ 7 ตอน เรื่องสั้นชุดคืนชีพ', 4, 'นิยาย', 'Crime', '2024-02-18', 'ชุดรวมเรื่องสั้นเล่มที่ ๓ นี้เป็นผลงานลำดับที่ ๗ ในหนังสือชุดเชอร์ล็อกส์ โฮล์มส์ จากชื่อเรื่องเดิม The Return of Sherlock Holmes  ตีพิมพ์ครั้งแรกในช่วงปี ๑๙๐๓ – ๑๙๐๔ และตีพิมพ์รวมเล่มในปี ๑๙๐๕ ฉบับภาษาไทยให้ชื่อว่า ชุด คืนชีพ ประกอบด้วยเรื่องสั้น 13 เรื่อง อาทิ บ้านร้าง รหัสตุ๊กตาเต้นรำ โรงเรียนสำนักอธิการ อาฆาตนโปเลียน นักรักบี้หาย ชู้รักของเลดี และรอยเปื้อนที่สอง\r\nหนังสือชุด “คืนชีพ” เป็นหนังสือรวมเรื่องของเชอร์ล็อก โฮล์มส์เล่มแรก หลังจากเหตุการณ์การ “ตาย” หรือ หายตัวไปของเขาใน ปัจฉิมปัญหา เรื่องสั้นเรื่องสุดท้ายในชุด “จดหมายเหตุ”   เมื่อเรื่องสั้นเหล่านี้ได้รับการตีพิมพ์ออกมา ผู้อ่านหลายคนมีความเห็นว่า โคแนน ดอยล์ เขียนเรื่องเหล่านี้ขึ้นเพียงเพื่อต้องการเอาใจผู้อ่านที่เรียกร้องให้เชอร์ล็อก โฮล์มส์กลับมา  ไม่ใช่เป็นเพราะเขาอยากเขียนขึ้นเองเพื่อให้ตัวละครเอกตัวนี้มีชีวิตในบรรณพิภพอีก  เนื้อหาบางเรื่องจึงอาจอ่อนด้อยไปบ้าง แต่ในขณะเดียวกัน ผู้อ่านอีกหลายคนก็ยังคงประทับใจในเรื่องราวเหล่านี้ และพร้อมจะใช้ความคิดติดตามแก้ไขปัญหาไปพร้อมๆ กับโฮล์มส์ และวัตสัน\r\n     ดังนั้น หากผู้อ่านต้องการทราบว่า เกิดอะไรขึ้นกับเชอร์ล็อก โฮล์มส์ กันแน่ และเขารอดชีวิตกลับมาได้อย่างไร และได้ใช้สติปัญญาและความสามารถไปใช้ช่วยคลี่คลายปัญหาในเรื่องอันลึกลับซับซ้อนได้อย่างไรถึง ๑๓ เรื่องในเล่มนี้  และเพื่อให้รู้ว่า ตัวท่านเองจะเป็นผู้อ่านประเภทไหน อย่างเดียวที่จะตอบได้ คือ ต้องอ่านเอง เพราะฉะนั้น ขอเชิญเปิดไปอ่านข้างในได้ทันที', 235, 'Sherlock_Holmes7.png'),
(22, 'เชอร์ล็อก โฮล์มส์ 8 ตอน เรื่องสั้นชุดลาโรง', 7, 'นิยาย', 'Crime', '2024-02-18', '  ชุดเรื่องสั้น ลำดับที่ 4 เชอร์ล็อก โฮล์มส์ ชุดลาโรง  จากเรื่องเดิม  His Last Bow  เป็นเรื่องสั้นรวม 8 เรื่อง แต่งโดย เซอร์ อาเทอร์ โคแนน ดอยล์   อาทิ จอมบงการใจทมิฬ ตามพิฆาต วงแดง หีบศพต่อพิเศษ และเชอร์ล็อก โฮล์มส์ ลาโรงตีพิมพ์ครั้งแรกเมื่อปี ค.ศ. 1917\r\n     เรื่องสั้นในชุดนี้ โฮล์มส์ และวัตสันจะได้พบกับคดีที่แปลกและท้าทาย  ทั้งเรื่องการปล่อยช่าวที่น่าตกใจ การลักพาตัว การขโมย การทรยศหักหลัง ฯลฯ แต่ไม่ว่าอย่างไร เชอร์ล็อก โฮล์มส์ ก็สามารถคลี่คลายปัญหาด้วยสติปัญญาแบบไม่เหมือนใคร  แม้โคแนน ดอยล์ จะถูกวิพากษ์วิจารณ์ว่าได้ผ่านช่วงรุ่งโรจน์ที่สุดในงานเขียนชุดเชอร์ล็อก โฮล์มส์ของเขาไปแล้ว  แต่หลายคนเห็นว่า เรื่องราวต่างๆ ในหนังสือเล่มนี้เป็นผลงานที่ดีมากอีกชุดหนึ่งทีเดียว  จึงหวังว่าผู้อ่านจะได้รับความสนุกสนานเพลิดเพลินไม่แพ้เรื่องในชุดอื่นๆ ที่ผ่านมา', 145, 'Sherlock_Holmes8.png'),
(23, 'เชอร์ล็อกโฮล์มส์ 9 ตอน บันทึกคดี', 9, 'นิยาย', 'Crime', '2024-02-18', 'The Case-Book of Sherlock Holmes  เป็นหนังสือชุดรวมเรื่องสั้นเล่มที่ 5  เล่มสุดท้ายของชุด  อันเป็นผลงานลำดับที่ 9 ในชุดเชอร์ล็อกส์ โฮล์มส์ ที่แต่งโดย เซอร์อาเทอร์ โคแนน ดอยล์   ชื่อภาษาไทย คือ ชุดบันทึกคดี  ตีพิมพ์ครั้งแรกเมื่อปี ค.ศ. 1927  ซึ่งห่างจากการพิมพ์หนังสือเชอร์ล็อก โฮล์มส์ลำดับแรกถึง 40 ปีทีเดียว  ประกอบด้วยคดีของเชอร์ล็อก โฮล์มส์ อีก 12 คดี อาทิ พรานพิศวาส ความจริงในนิยาย ผีดิบอาละวาด พินัยกรรมประหลาด สะพานมรณะ ขนคอสิงห์ และสุสานร้าง\r\n \r\n    แม้หนังสือเล่มนี้ยังได้รับความสนใจจากผู้อ่านและมียอดขายอยู่ในเกณฑ์ดีเช่นเดียวกับชุดก่อนๆ  แต่ก็มีผู้วิจารณ์ว่าเรื่องราวต่างๆ ไม่ค่อยน่าประทับใจเท่าเดิม  เนื่องจากผู้แต่งไม่ค่อยมีแก่ใจในการแต่งเรื่องนี้แล้ว เพราะไปสนใจแต่งเรื่องอื่นอยู่  อย่างไรก็ตาม แฟนของเชอร์ล็อก โฮล์มส์อีกหลายคนกลับไม่ได้คิดเช่นนั้น เพราะแม้ว่าความลึกลับซับซ้อนของคดีจะไม่มีความแยบยลเท่าเรื่องเอกๆ ของโฮล์มส์ในอดีต แต่ก็ยังมีความโดดเด่นตามมาตรฐาน ซ้ำยังแสดงให้เห็นภาพของความชั่วร้ายที่เหมือนชีวิตจริงยิ่งกว่า นักอ่านที่ไม่ชอบเรื่องสืบสวนสอบสวน ก็ยังสามารถอ่านได้อย่างสนุก\r\n\r\nรวมเรื่องสั้นชุดนี้ มีความแตกต่างจากชุดก่อนๆ เล็กน้อย ที่เดิมทุกเรื่องจะเป็นหมอวัตสันเป็นผู้เล่าเรื่อง แต่เรื่องที่ 2 และเรื่องที่ 9 เป็นการเล่าเรื่องโดยเชอร์ล็อก โฮล์มส์เอง  และเรื่องที่ 3 ผู้เล่าเป็นบุรุษที่ 3  อ่านแล้วก็อาจได้พบว่าโฮล์มส์ก็เล่าเรื่องได้สนุกไม่แพ้หมอวัตสันเหมือนกัน', 155, 'Sherlock_Holmes9.png'),
(24, 'กระซิบรักเป็นทำนองร้องบอกเธอ เล่ม 1', 10, 'Manga', 'Yuri', '2024-02-18', 'พวกเราต่างหลงรักกันในฤดูกาลที่ดอกซากุระโปรยปราย\r\n\r\nวันเปิดภาคเรียนโรงเรียนมัธยมปลาย\r\nฮิมาริ นักเรียนน้องใหม่ตกหลุมรักโยริ รุ่นพี่นักร้องนำวงดนตรี\r\nในคอนเสิร์ตงานรับน้องตั้งแต่แรกเห็น\r\n\r\n\r\nเธอได้พบกับโยริที่ล็อกเกอร์ในอาคารเรียนและบอกกับเจ้าตัวเช่นนั้น\r\nทำให้โยริตกหลุมรักรุ่นน้องคนนี้ที่กล้าเอ่ยความรู้สึกอย่างตรงไปตรงมาตั้งแต่แรกเห็นเช่นกัน\r\n\r\nหากแต่คำว่า ‘รัก’ ของพวกเธอ\r\nกลับมีความหมายที่แตกต่าง...\r\n\r\n\r\nนี่เองคือจุดเริ่มต้นเรื่องราวความสัมพันธ์\r\nของสองสาวที่ต่างคนต่างรัก \r\nแต่สวนทางกันในความรู้สึกลึกๆ', 185, 'Sasayaku_vol1.png'),
(25, 'Lily Lily la la Land เล่ม 1', 10, 'Manga', 'Yuri', '2024-02-18', 'ณ โรงเรียนสตรีริกกะมง โรงเรียนประจำซึ่งมีประวัติศาสตร์ยาวนาน\r\nมีระบบพาร์ตเนอร์ที่ให้นักเรียนคอยช่วยเหลือเกื้อกูลกันอันเรียกว่า ‘ระบบจับคู่’\r\nซึ่งจะเป็นได้เมื่อแลกกุญแจหอสำรองกับใครสักคน\r\n.\r\nศูนย์รวมความสนใจของเหล่านักเรียนในโรงเรียนก็คือระบบนี้\r\nและ ‘งานเลี้ยงน้ำชาเฉพาะผู้ได้รับเชิญของคุณหนูทั้งห้า’\r\nคุณหนูทั้งห้าเป็นทั้งความใฝ่ฝัน อีกทั้งยังเป็นระเบียบแก่นักเรียนทั้งโรงเรียน\r\n.\r\nทว่าการมีอยู่ของ ‘กุญแจดอกหนึ่ง’ ซึ่งถูกส่งไปถึงนักเรียนม.ปลายปี 1 เควากิ เอมิ\r\nกลับกลายเป็นที่มาของเหตุการณ์ไม่คาดฝัน...', 175, 'Lily_Lily_la_la_Land_vol1.png'),
(26, 'วิวาห์ของลาล่า เล่ม 1', 10, 'Manga', 'Yaoi', '2024-02-18', 'ในพิธีวิวาห์ของตระกูลเศรษฐีใหญ่ \'ลาล่า\' ว่าที่เจ้าสาวตัดสินใจหนีตามคนรักของเธอไป\r\nทำให้ \'รัมดาน\' พี่ชายฝาแฝดตัดสินใจปลอมตัวเป็นลาล่าเพื่อสวมรอยเข้าพิธีวิวาห์แทน\r\n\r\nเมื่อเสร็จพิธีวิวาห์จนถึงเวลาเข้าห้องหอ ขณะที่รัมดานกำลังคิดวางแผนจะหลบหนี\r\nเขากลับถูก \'โวลซีย์\' เจ้าบ่าวหมาดๆ ให้ดื่มสุรามงคลผสมยาปลุกกำหนัด\r\nจากนั้นก็บังคับขืนใจให้ร่วมรักกันอย่างเร่าร้อนรุนแรง\r\n\r\nเหตุการณ์ในคืนนั้นทำให้รัมดานทั้งระแวง เกลียด และสงสัย\r\nว่าทำไมโวลซีย์ที่น่าจะต้องการแต่งงานกับลาล่า แต่กลับกอดตนซึ่งเป็นผู้ชายเหมือนกันได้อย่างสนิทใจ\r\nเหตุผลนั้นคืออะไรกันแน่!?', 175, 'Lala_no_Kekkon_vol1.png'),
(27, 'วิวาห์ของลาล่า เล่ม 2', 1, 'Manga', 'Yaoi', '2024-02-24', 'ในพิธีวิวาห์ของตระกูลเศรษฐีใหญ่ \'ลาล่า\' ว่าที่เจ้าสาวตัดสินใจหนีตามคนรักของเธอไป\r\nทำให้ \'รัมดาน\' พี่ชายฝาแฝดตัดสินใจปลอมตัวเป็นลาล่าเพื่อสวมรอยเข้าพิธีวิวาห์แทน\r\n\r\nเมื่อเสร็จพิธีวิวาห์จนถึงเวลาเข้าห้องหอ ขณะที่รัมดานกำลังคิดวางแผนจะหลบหนี\r\nเขากลับถูก \'โวลซีย์\' เจ้าบ่าวหมาดๆ ให้ดื่มสุรามงคลผสมยาปลุกกำหนัด\r\nจากนั้นก็บังคับขืนใจให้ร่วมรักกันอย่างเร่าร้อนรุนแรง\r\n\r\nเหตุการณ์ในคืนนั้นทำให้รัมดานทั้งระแวง เกลียด และสงสัย\r\nว่าทำไมโวลซีย์ที่น่าจะต้องการแต่งงานกับลาล่า แต่กลับกอดตนซึ่งเป็นผู้ชายเหมือนกันได้อย่างสนิทใจ\r\nเหตุผลนั้นคืออะไรกันแน่!?', 175, 'Lala_no_Kekkon_vol2.png');

-- --------------------------------------------------------

--
-- Table structure for table `cart`
--

CREATE TABLE `cart` (
  `CartID` int(11) NOT NULL,
  `CusID` int(11) NOT NULL,
  `BID` int(11) NOT NULL,
  `TotalQuantity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cart`
--

INSERT INTO `cart` (`CartID`, `CusID`, `BID`, `TotalQuantity`) VALUES
(1, 2, 2, 1),
(2, 2, 4, 1),
(3, 2, 2, 1),
(4, 2, 2, 1),
(5, 2, 4, 1),
(6, 2, 10, 1),
(7, 2, 11, 1),
(8, 2, 12, 1),
(34, 1, 11, 1);

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `ID` int(255) NOT NULL,
  `Name` varchar(255) NOT NULL,
  `Email` varchar(255) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Address` varchar(255) DEFAULT NULL,
  `Province` varchar(255) DEFAULT NULL,
  `Zipcode` int(255) DEFAULT NULL,
  `Phone` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`ID`, `Name`, `Email`, `Password`, `Address`, `Province`, `Zipcode`, `Phone`) VALUES
(1, 'JoeMaMaHaha', 'Joemydada@gmail.com', 'JMM123456', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11191, '0899899999'),
(2, 'Mahakai', 'Makai_Son123@gmail.com', 'Malakai@Son112', '123 ถ.หมื่นหาญ ต.วัดใหม่', 'จันทบุรี', 11150, '0534567890'),
(3, 'Mathamai', 'Mahai_mai123@gmail.com', 'Mamai@Son112', '123 ถ.หมื่นหาญ ต.วัดใหม่', 'จันทบุรี', 11150, '0922222222'),
(4, 'JoeMaMaHaha', 'Joemymom@gmail.com', 'JMM12345', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11191, '0899899999'),
(5, 'ปํญญา เก่งกาจ', 'PanyaPrecha_5461@gmail.com', 'Precha_Sammad@777', '123 ถ.หมื่นหาญ ต.วัดใหม่', 'จันทบุรี', 22000, '0925553169'),
(6, 'Bill555', 'BillyHood_l50@gmail.com', 'Baba@UK555', '70/1002 ถ.มาลัยแมน ต.ทุ่งกระพังโหม', 'นครปฐม', 73140, '0922801222'),
(21, 'Beaver', 'Beaver1234@gmail.com', 'Beaver@12345', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11191, '1111111111'),
(22, 'Adam', 'Smasher1234@gmail.com', 'RIP@Moon1234', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11150, '0891XXXXXX'),
(23, 'Altair', 'Altair1234@gmail.com', 'Altair12345', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11150, '0899899999'),
(24, 'Braharm', 'Harmmy1234@gmail.com', 'Brather12345', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11191, '0899899999'),
(25, 'Grid', 'GitGud888@gmail.com', 'Gitty1208', '123 ถ.หมื่นหสญ ต.วัดใหม่', 'จันทบุรี', 11191, '1111111111');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `OrderID` int(11) NOT NULL,
  `CusID` int(11) NOT NULL,
  `BID` int(11) NOT NULL,
  `TotalQuantity` int(11) NOT NULL,
  `OrderStat` enum('Paid','Not Paid') NOT NULL DEFAULT 'Not Paid',
  `OrderedAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`OrderID`, `CusID`, `BID`, `TotalQuantity`, `OrderStat`, `OrderedAt`) VALUES
(1, 2, 2, 1, 'Not Paid', '2025-03-03 21:22:54'),
(2, 2, 17, 1, 'Not Paid', '2025-03-03 22:01:09'),
(3, 2, 19, 1, 'Not Paid', '2025-03-03 22:01:56'),
(4, 1, 11, 1, 'Not Paid', '2025-03-03 23:56:36');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`AdminID`);

--
-- Indexes for table `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`BookID`);

--
-- Indexes for table `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`CartID`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`OrderID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `AdminID` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `book`
--
ALTER TABLE `book`
  MODIFY `BookID` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `cart`
--
ALTER TABLE `cart`
  MODIFY `CartID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `ID` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `OrderID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
